---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.AddedElementsNotSamePhaseAsAssembly
source: html/907afa72-b0a4-b0ee-15c2-d1e4bb9dccb0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures.AddedElementsNotSamePhaseAsAssembly Property

Selected Element(s) cannot be added to the assembly. Elements must have the same phases as the assembly to be included in the assembly.

## Syntax (C#)
```csharp
public static FailureDefinitionId AddedElementsNotSamePhaseAsAssembly { get; }
```